{ "bikes": [{
    "bikePhoto1": "https://cloud.yamahamotorsports.com/library/img.jpg?id=57f7c9bc2a0ab6342475a7ad&w=840",
    "bikePhoto2": "https://cloud.yamahamotorsports.com/library/img.jpg?id=57f7c9bb2a0ab6342475a7ab&w=840",
    "bikePhoto3": "https://cdn.yamaha-motor.eu/product_assets/2017/YZF1000R1SPL/950-75/2017-Yamaha-YZF-R1M-EU-Silver-Blu-Carbon-VR360-006.jpg",
    "name": "Yamaha YZF-R1M",
    "engineType": "998cc, liquid-cooled inline 4 cylinder DOHC; 16 valves",
    "transmission": "6-speed w/multiplate slipper clutch",
    "price": "22499",
    "description": "The R1M® is the closest thing ever to the Yamaha Factory Racing M1 -- and the pinnacle of superbike performance.",
    "yearOfManufacture": "2017",
    "details": " features a lightweight and compact crossplane crankshaft, inline-four-cylinder, 998cc high output engine. Featuring a first ever for a production motorcycle, titanium fracture split connecting rods delivering extremely high horsepower and a strong pulse of linear torque for outstanding performance.",
    "details2": "The YZF-R1M features an Öhlins® Electronic Racing Suspension (ERS), carbon fiber bodywork, and a Communication Control Unit (CCU) with GPS that enables the rider to capture ride data (including GPS tracking) and then download it via WiFi to the Yamaha Y-TRAC smartphone and tablet app. Once the data is downloaded, the rider can analyze it overlaid with the track map. Setting changes can then be made via the YRC Setting app and uploaded back to the R1M.",
    "manufacturer": "yamaha-motors"
  }, {
    "bikePhoto1": "https://cloud.yamahamotorsports.com/library/img.jpg?id=57f2bf8e2a0ab63620da53fb&w=840",
    "bikePhoto2": "https://cloud.yamahamotorsports.com/library/img.jpg?id=57f2bf8d2a0ab63620da53f9&w=840",
    "bikePhoto3": "https://cloud.yamahamotorsports.com/library/img.jpg?id=57f2bf8e2a0ab63620da53fc&w=840",
    "name": "Yamaha YZF-R6",
    "engineType": "599cc liquid-cooled DOHC inline 4-cylinder; 16 titanium valves",
    "transmission": "6-speed w/multiplate slipper clutch",
    "price": "12199",
    "description": "From its new aggressive styling with M1-inspired styling, new 7-setting Traction Control, Drive Modes, new R1-spec front forks and brakes plus much more",
    "yearOfManufacture": "2017",
    "details": "On track or street, the YZF-R6® was already one of the most advanced and successful supersport machines ever built. For 2017, radical new styling wraps up an even more intelligent racing machine, complete with ABS brakes, new suspension and new electronic rider aids.",
    "details2": "Already one of the most nimble machines in the supersport class, 2017 brings additional mass-centralization to the proven R6 package along with updated suspension, for improved front-end feedback and greater cornering confidence.",
    "manufacturer": "yamaha-motors"
  }, {
    "bikePhoto1": "https://cloud.yamahamotorsports.com/library/img.jpg?id=30152&w=840",
    "bikePhoto2": "https://cloud.yamahamotorsports.com/library/img.jpg?id=30150&w=840",
    "bikePhoto3": "https://cloud.yamahamotorsports.com/library/img.jpg?id=30153&w=840",
    "name": "Yamaha BOLT C‑SPEC",
    "engineType": "58-cubic-inch (942cc) air-cooled SOHC 4-stroke V-twin; 4 valves",
    "transmission": "5-speed; multiplate wet clutch",
    "price": "8690",
    "description": "The perfect platform for customization combined with a powerful FI 942cc V-Twin and café-racer styling.",
    "yearOfManufacture": "2016",
    "details": " The Bolt® C-Spec epitomizes the cool “Café” style popular across the globe since the 1960’s. Bolt C-spec features café styling with original Star V-twin performance and includes clip-on handlebars, traditional fork boots, a removable passenger seat cowl, and sporty café paint and graphics that makes the Bolt C-Spec ultracool.",
    "details2": "The Bolt C-Spec uses modern technology to create a riding experience superior to other similarly sized machines. Fuel injection and ignition timing maps have been set to deliver class-leading performance with strong low- and mid-range torque sure to bring a smile to every rider’s face.",
    "manufacturer": "yamaha-motors"
  },{
    "bikePhoto1": "https://i0.wp.com/ridermagazine.com/wp-content/uploads/2016/11/BMW-S1000RR.jpg?resize=620%2C413",
    "bikePhoto2": "http://motorcycle.com.vsassets.com/blog/wp-content/uploads/2014/09/093014-2015-bmw-s1000rr-P90162325_highRes.jpg",
    "bikePhoto3": "https://s-media-cache-ak0.pinimg.com/originals/0c/33/b6/0c33b669e1abfe2608d90642fbb859e6.jpg",
    "name": "BMW S 1000 RR",
    "engineType": "Water/oil-cooled 4-cylinder 4-stroke in-line engine, 4valve.",
    "transmission": "Constant-mesh 6-speed gearbox",
    "price": "18690",
    "description": "The BMW S 1000 RR led to a revolution in the sport superbikes category right from the outset.",
    "yearOfManufacture": "2017",
    "details": " the bike continued to be developed, its tried and tested concept being honed even further and the latest technology added. One constant factor remained throughout, however, - the RR's impressive power curve and, in terms of performance, it is still a trailblazer today. ",
    "details2": "The S 1000 RR’s liquid-cooled four-cylinder in-line engine is capable of 146 kW (199 hp) at 13,5000 r.p.m. and a maximum torque of 113 Nm at 10,500 r.p.m. Impressive statistics that are palpable to its riders. Yet even with this level of performance, the standard DTC Dynamic Traction Control ensures significantly greater safety.",
    "manufacturer": "BMW-Motorrad"
  }, {
    "bikePhoto1": "http://www.cycleworld.com/sites/cycleworld.com/files/styles/medium_1x_/public/wp-content/uploads/2014/12/2015-BMW-R1200R-studio-7.jpg?itok=60Vivmo8",
    "bikePhoto2": "https://www.motorcycleparts-hornig.com/press/2015/bmw-r1200r-2015-3g.jpg",
    "bikePhoto3": "https://s1.cdn.autoevolution.com/images/moto_gallery/BMW-R-1200-R-10838_5.jpg",
    "name": "BMW R 1200 R",
    "engineType": "Air/liquid-cooled four stroke flat twin engine",
    "transmission": "Constant mesh 6-speed gearbox with helical gear teeth",
    "price": "10690",
    "description": "The R 1200 R marks the status quo in terms of aesthetic appeal, dynamic performance and design.",
    "yearOfManufacture": "2015",
    "details": "When our developers put forward their visions in the BMW Concept Roadster, this bike was their greatest source of inspiration. And that's no surprise - after all, the new R 1200 R is a powerful all-rounder that combines comfort, athletic flair and design in an entirely unique way.",
    "details2": "The R 1200 R is ahead of its time in terms of technology, too. A total of 125 hp provides supreme propulsion in the new R 1200 R. Together with the riding modes that can be accessed at the press of a button, the optionally available traction control (DTC) puts this power effectively onto the asphalt. The rider has everything in view and under control thanks to the redesigned and expanded instrument panel. This sits on a bridge made of high-end aluminium in the cockpit.",
    "manufacturer": "BMW-Motorrad"
  }, {
    "bikePhoto1": "http://www.cycleworld.com/sites/cycleworld.com/files/styles/large_1x_/public/images/2016/10/p90233749-highres.jpg?itok=Veh6QZWP&fc=50,50",
    "bikePhoto2": "http://www.motorevue.com/wp-content/uploads/2016/09/P90233751_highRes.jpg",
    "bikePhoto3": "http://www.cycleworld.com/sites/cycleworld.com/files/styles/large_1x_/public/images/2016/10/p90233748-highres.jpg?itok=JoRgpQzu",
    "name": "BMW  R NINET PURE",
    "engineType": "Air/oil-cooled flat twin ('Boxer') 4-stroke engine",
    "transmission": "Constant mesh 6-speed gearbox with helical gear teeth",
    "price": "11690",
    "description": "The BMW R nineT Pure is perfect for everyone who loves the classic roadster design and is looking for a pure motorcycle experience.",
    "yearOfManufacture": "2017",
    "details": "It is reminiscent of the 1970's and 80's era. But its roots go deeper. Even the very first motorcycle from BMW was simple, reduced and dynamic. Back then, in 1923, the BMW opposed-twin engine was already the heart of the entire concept. ",
    "details2": "The design of the R nineT Pure is reminiscent of a typical roadster. The circular headlamp with a chrome ring, varnished housing and the new circular tachometer influence the look of the front. The proportions are determined by the three-part bridge frame together with the new classic looking telefork. The supporting element: the opposed-twin engine, just waiting to roar. The steel tank and the typically narrow rear complete a silhouette that is both stylish and elegant.",
    "manufacturer": "BMW-Motorrad"
  },{
    "bikePhoto1": "https://motorbikewriter.com/content/uploads/2016/08/7263.jpg",
    "bikePhoto2": "http://bikesdata.com/data/images/Harley-Davidson-Street-500a.jpg",
    "bikePhoto3": "https://cdp.azureedge.net/products/USA/HD/2017/MC/CRUISER/STREET_500/50/VIVID_BLACK/2000000002.jpg",
    "name": "Harley-Davidson street 500",
    "engineType": "Liquid-cooled, Revolution X V-Twin",
    "transmission": "Constant-mesh 6-speed gearbox",
    "price": "6849",
    "description": "The action goes from stoplight to stoplight, boulevard to back alley. At the center of it all you carve through heat, chaos and gridlock with ease",
    "yearOfManufacture": "2017",
    "details": "You get a liquid-cooled Revolution X™ engine loaded with torque and built to thrive in stop and go traffic. A light frame with an easy lock-to-lock handlebar sweep for quick moves. And dark styling details like blacked out pipes, café-style windscreen and fork gaiters to put the edge on the look. Got any plans for the evening?",
    "details2": "We built the Harley-Davidson Street® series to be affordable machines for those who’ve gotta work to put gas in the tank and pay the meter maid when you find a place to park. But we did it our own way. That means we did it right. The beautifully formed teardrop fuel tank is Milwaukee steel, just like the fenders. Then we painstakingly finish it with one of our premium paintjobs, and top it with a 3-D chrome badge. Not a decal. Fire up the engine and you hear the pure signature rumble of a Harley-Davidson V-Twin.",
    "manufacturer": "Harley-Davidson"
  }, {
    "bikePhoto1": "http://www.motorcyclecruiser.com/sites/motorcyclecruiser.com/files/styles/large_1x_/public/buyers_guide/2017/2017_Harley-Davidson_S-Series_FatBoy.jpg?itok=57rgJ1ad",
    "bikePhoto2": "http://www.cycleworld.com/sites/cycleworld.com/files/styles/large_1x_/public/buyers_guide/2013/2013_Harley-Davidson_Softail_FatBoyLoAnniversary.jpg?itok=sSEk9Zds",
    "bikePhoto3": "https://cdn.shopify.com/s/files/1/1367/1079/products/17_FLSTFB_AF.jpg?v=1473218743",
    "name": "Harley-Davidson Fatboy S",
    "engineType": "Screamin' Eagle Air-cooled, Twin Cam 110B",
    "transmission": "Constant mesh 6-speed gearbox with helical gear teeth",
    "price": "20199",
    "description": "This takes dark to a new level. A powerful one. New gloss black Screamin’ Eagle Air-Cooled Twin Cam 110B engine, gloss black lower forks",
    "yearOfManufacture": "2017",
    "details": "The air-cooled 45° V-Twin engine at the heart of every Softail® model is a prime example of what makes a Harley-Davidson® motorcycle more satisfying than anything else. Its clean, uncluttered shape fits perfectly in the downtubes of the frame. Twist the throttle and the surge of torque hits you exactly where it counts. The knowledge of what makes an engine truly move a rider runs deep at The Motor Company, and it’s been put to particular good use to power the Softail family.",
    "details2": " We counterbalance the engine, which means we can bolt it directly to the frame. It keeps the styling tight at the center of the bike. It lets the rider feel the pulse of the V-Twin. Yet there aren’t any vibrations rattling the fillings out of your teeth. What’s good gets even better. The S Series gets a power upgrade to the Screamin’ Eagle; Air-Cooled Twin Cam 110B engine. More power is always a Harley-Davidson tradition.",
    "manufacturer": "Harley-Davidson"
  }, {
    "bikePhoto1": "http://www.powersportsnetwork.com/powersportsdlr/images/NewVehicles/2011/2011_5_199597_VividBlackwithFlames.jpg",
    "bikePhoto2": "https://s-media-cache-ak0.pinimg.com/736x/d3/09/4f/d3094f2939ea915305e7f95c39e0e3bc.jpg",
    "bikePhoto3": "https://s-media-cache-ak0.pinimg.com/originals/06/7d/52/067d52218be2646960346ef17390263d.jpg",
    "name": "Harley-Davidson Wide Glide",
    "engineType": "Air-cooled, High Output Twin Cam 103",
    "transmission": "Constant mesh 6-speed gearbox with helical gear teeth",
    "price": "16000",
    "description": "From the raked out wide fork straddling the 21-inch laced wheel to the Tommy Gun exhaust the Wide Glide brings old school chopper design to a new generation.",
    "yearOfManufacture": "2017",
    "details": "Journey back far enough in the factory custom history of the Dyna family and you get to the machine that started the whole thing off: a Harley-Davidson touring bike. Seriously, and that’s your first clue to the rider comfort that waits for you in the saddle of today’s Dyna motorcycle. That early touring machine featured a new kind of isolation mounting system for the engine. Which led to a series of innovative frame designs.",
    "details2": "The motorcycles in the Dyna® family trace their roots to the original Harley-Davidson® factory customs. Notice the powerful front ends, chromed steel details and tricked-out wheels. There isn’t an ounce of doubt that you’re looking at a rolling sculpture. But there’s something bigger at work here than a mere visual statement. These are motorcycles sprung from a long riding tradition, with a strong emphasis on the riding. Post-war bobbers. Rebellious 70s choppers.",
    "manufacturer": "Harley-Davidson"
  },{
    "bikePhoto1": "http://www.cycleworld.com/sites/cycleworld.com/files/styles/large_1x_/public/images/2016/11/cw1116-2017-ducati-1299-superleggera-image-03.jpg?itok=Mm4K4VHb",
    "bikePhoto2": "http://cdn.hiconsumption.com/wp-content/uploads/2016/11/2017-Ducati-1299-Superleggera-02.jpg",
    "bikePhoto3": "http://www.cycleworld.com/sites/cycleworld.com/files/styles/large_1x_/public/images/2016/11/cw1116-2017-ducati-1299-superleggera-image-04.jpg?itok=Dlc9SolO",
    "name": "Ducati 1299 SUPERLEGGERA",
    "engineType": "Superquadro: L-twin cylinder, 4 valve per cylinder, Desmodromic, liquid cooled",
    "transmission": "6 speed with Ducati Quick Shift (DQS) up/down",
    "price": "24999",
    "description": "Ducati takes the world of Supersport road bikes to a completely new level by presenting the 1299 Superleggera, the first standard street bike with carbon fibre frame",
    "yearOfManufacture": "2017",
    "details": "Ducati takes the world of Supersport road bikes to a completely new level by presenting the 1299 Superleggera, the first standard street bike with carbon fibre frame, swinging arm, subframe and wheels. The 1299 Superleggera is the greatest expression of engineering, technology and performance ever put into mass production by a motorcycle manufacturer. ",
    "details2": "The exclusivity of the 1299 Superleggera is underlined by the new electronic package that uses an inertial platform system with six axes (6D IMU - Inertial Measurement Unit) to manage the electronic controls that on this bike rise to a level of primacy. This system has made it possible to further develop the Ducati Traction Control EVO (DTC EVO) presented on the 1299 Panigale S Anniversario thanks to the introduction of the Ducati Slide Control (DSC).",
    "manufacturer": "Ducati"
  }, {
    "bikePhoto1": "https://cdn2.cycletrader.com/v1/media/58ddf8a5d4327866eb61a860.jpg?width=512&height=384&quality=60",
    "bikePhoto2": "http://www.cycleworld.com/sites/cycleworld.com/files/styles/large_1x_/public/images/2016/10/03_supersport_s.jpg?itok=BThpg82e",
    "bikePhoto3": "http://images.mcn.bauercdn.com/PageFiles/556953/1000x750/b.jpg",
    "name": "Ducati 959 Panigale",
    "engineType": "Superquadro: L-twin cylinder, 4 valve per cylinder, Desmodromic, liquid cooled.",
    "transmission": "6 speed with Ducati Quick Shift (DQS)",
    "price": "26599",
    "description": "On the new 959 Panigale, the new features are not limited to the engine: the aesthetics and set-up have also been significantly improved with some important updates.",
    "yearOfManufacture": "2016",
    "details": "Every detail of the 959 Panigale is a tribute to the Ducati racing tradition. A wider and more protective screen that ensures greater aerodynamic penetration, new air vents on the fairing and new rear-view mirrors complete the front fairing.",
    "details2": "The new tail, divided into two sections, completes the design of the 959 Panigale, further enhanced by new details such as differently shaped footpegs, made from machined billet aluminium, for the perfect combination of beauty and functionality.As with the bigger 1299 Panigale, the set-up of the 959 Panigale is entrusted to a compact monocoque structure, in fused aluminium to increase its resistance, using the Superquadro engine as a structural element.",
    "manufacturer": "Ducati"
  }]
}
